请妥善保管私钥（解密时需要用到）：（n: 9271  ,d: 953 )
输入你要加密的内容:
c
您的加密数字串结果为： 6291


输入您的私钥（n,d）: 9271 953
输入您需要解密的数字串：
6291
您的解密utf-8串结果为： c


请妥善保管私钥（解密时需要用到）：（n: 72311  ,d: 57853 )
输入你要加密的内容:
haha
您的字符串编码结果为： b'haha'
您的字符串字节转为int结果为： 1751214177
您的加密数字串结果为： 15823

输入您的私钥（n,d）:72311 57853
输入您需要解密的数字串：
15823
您的密文解密成int为： 58690
您的解密结果为： 

进程已结束，退出代码为 0

请妥善保管私钥（解密时需要用到）：（n: 245457414113  ,d: 169337363533 )
输入你要加密的内容:
haha
您的字符串编码结果为： b'haha'
您的字符串字节转为int结果为： 1751214177
您的加密数字串结果为： 18280702066


输入您的私钥（n,d）:245457414113 169337363533
输入您需要解密的数字串：
18280702066
您的密文解密成int为： 1751214177
您的解密结果为： haha

进程已结束，退出代码为 0